examples/DRLinFluids_DFDRL_cylinder/env04/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0.750";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
16200
(
(0.78712 0.680418 7.52216e-22)
(0.535061 0.392256 1.60836e-20)
(0.723454 0.613236 0)
(0.712378 0.329733 -1.81206e-20)
(0.92915 0.777137 -8.80469e-21)
(0.912975 0.793675 0)
(1.11537 0.839077 -5.52043e-20)
(1.15798 0.57224 0)
...
)
;

boundaryField
{
    INLET
    {
        type            inletParabolicVelocity;
        maxValue        1.5;
        n               (1 0 0);
        y               (0 1 0);
        value           nonuniform List<vector> 
21
(
(0.833333 0 0)
(0.629252 0 0)
(0.139456 0 0)
(0.833334 0 0)
(1.37755 0 0)
(1.48639 0 0)
(0.397959 0 0)
(0.139456 0 0)
(0.39796 0 0)
(0.629252 0 0)
(1.0102 0 0)
(1.15986 0 0)
(1.0102 0 0)
(1.28231 0 0)
(1.15986 0 0)
(1.44558 0 0)
(1.48639 0 0)
(1.5 0 0)
(1.37755 0 0)
(1.44558 0 0)
(1.28231 0 0)
)
;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    TOP
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    BOTTOM
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    CYLINDER
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    JET1
    {
        type            uniformFixedValue;
        uniformValue    tableFile;
        uniformValueCoeffs
        {
            file            "./system/jet.csv";
            format          csv;
            nHeaderLine     0;
            refColumn       0;
            componentColumns List<label> 3(1 2 3);
            separator       ",";
            mergeSeparators 0;
        }
        value           uniform (0 0 0);
    }
    JET2
    {
        type            uniformFixedValue;
        uniformValue    tableFile;
        uniformValueCoeffs
        {
            file            "./system/jet.csv";
            format          csv;
            nHeaderLine     0;
            refColumn       0;
            componentColumns List<label> 3(1 2 3);
            separator       ",";
            mergeSeparators 0;
        }
        value           uniform (0 0 0);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
