examples/DRLinFluids_DFDRL_cylinder/env04/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.750";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
16200
(
-0.176346
-0.3432
-0.393015
-0.622261
-0.11189
-0.34748
-0.472992
-0.652386
...
)
;

boundaryField
{
    INLET
    {
        type            zeroGradient;
    }
    OUTLET
    {
        type            fixedValue;
        value           uniform 0;
    }
    TOP
    {
        type            zeroGradient;
    }
    BOTTOM
    {
        type            zeroGradient;
    }
    CYLINDER
    {
        type            zeroGradient;
    }
    JET1
    {
        type            zeroGradient;
    }
    JET2
    {
        type            zeroGradient;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
