examples/DRLinFluids_DFDRL_cylinder/env04/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0.750";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
23855
(
9.83113e-05
-0.000706912
0.0006086
0.000623796
-0.000394314
-0.000229482
0.000835618
-0.00035902
...
)
;

boundaryField
{
    INLET
    {
        type            calculated;
        value           nonuniform List<scalar> 
21
(
-0.000728199
-0.000549864
-0.000121862
-0.000728198
-0.00120376
-0.00129887
-0.000347752
-0.000121862
-0.000347752
-0.000549864
-0.000882755
-0.00101353
-0.000882755
-0.00112053
-0.00101353
-0.0012632
-0.00129887
-0.00131076
-0.00120376
-0.0012632
-0.00112053
)
;
    }
    OUTLET
    {
        type            calculated;
        value           nonuniform List<scalar> 
21
(
0.00114666
0.000974534
0.00116573
0.000774445
0.000706348
0.000797861
0.000486601
0.000637839
0.0011063
0.00104135
0.000927621
0.00114559
0.00109194
0.000700424
0.00101486
0.000857921
0.00082057
0.000837938
0.000757141
0.000905858
0.000473881
)
;
    }
    TOP
    {
        type            calculated;
        value           uniform 0;
    }
    BOTTOM
    {
        type            calculated;
        value           uniform 0;
    }
    CYLINDER
    {
        type            calculated;
        value           uniform 0;
    }
    JET1
    {
        type            calculated;
        value           uniform 0;
    }
    JET2
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBackPlanes
    {
        type            empty;
        value           nonuniform List<scalar> 0();
    }
}


// ************************************************************************* //
