examples/DRLinFluids_DFDRL_cylinder/env04/0/phi_0
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0.750";
    object      phi_0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
23855
(
9.81722e-05
-0.000707446
0.000609274
0.000624702
-0.000395396
-0.000229306
0.00083657
-0.000359102
...
)
;

boundaryField
{
    INLET
    {
        type            calculated;
        value           nonuniform List<scalar> 
21
(
-0.000728199
-0.000549864
-0.000121862
-0.000728198
-0.00120376
-0.00129887
-0.000347752
-0.000121862
-0.000347752
-0.000549864
-0.000882755
-0.00101353
-0.000882755
-0.00112053
-0.00101353
-0.0012632
-0.00129887
-0.00131076
-0.00120376
-0.0012632
-0.00112053
)
;
    }
    OUTLET
    {
        type            calculated;
        value           nonuniform List<scalar> 
21
(
0.00114691
0.000975363
0.00116572
0.000773646
0.000705662
0.000798427
0.000486748
0.00063758
0.00110681
0.00104204
0.000926771
0.00114533
0.00109148
0.000699879
0.00101418
0.000858707
0.000819655
0.000838639
0.000757399
0.000906679
0.000473799
)
;
    }
    TOP
    {
        type            calculated;
        value           uniform 0;
    }
    BOTTOM
    {
        type            calculated;
        value           uniform 0;
    }
    CYLINDER
    {
        type            calculated;
        value           uniform 0;
    }
    JET1
    {
        type            calculated;
        value           uniform 0;
    }
    JET2
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBackPlanes
    {
        type            empty;
        value           nonuniform List<scalar> 0();
    }
}


// ************************************************************************* //
