examples/DRLinFluids_DFDRL_cylinder/env04/0/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0.750";
    object      vorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<vector> 
16200
(
(-6.00719e-17 7.06734e-17 9.76306)
(-2.6511e-16 4.00652e-16 13.0529)
(-2.32872e-18 -1.32569e-18 19.4576)
(1.14507e-16 -3.40773e-16 26.323)
(8.49322e-16 -9.93433e-16 7.63024)
(5.26071e-19 1.69952e-18 17.2164)
(1.66663e-15 -2.24576e-15 21.6632)
(8.84304e-19 -2.81096e-18 30.6742)
...
)
;

boundaryField
{
    INLET
    {
        type            calculated;
        value           nonuniform List<vector> 
21
(
(-3.61904e-17 1.60494e-15 11.4168)
(-1.93772e-19 0 12.4301)
(3.12637e-18 -1.81896e-16 9.71238)
(0 0 -10.4048)
(1.36109e-17 -7.5223e-16 7.26818)
(1.27393e-19 0 -0.0677784)
(-6.96396e-18 3.16277e-16 12.8005)
(-1.46226e-18 -2.24689e-25 -9.78394)
(3.93224e-18 1.11274e-16 -12.4618)
(-1.51582e-18 0 -11.3248)
(3.15396e-19 0 11.3106)
(0 0 9.80706)
(0 0 -9.21376)
(-1.31246e-17 6.73758e-16 8.56631)
(-9.93937e-18 -1.20954e-15 -8.03526)
(-5.86037e-19 0 5.81266)
(-5.62538e-20 0 4.05674)
(5.5771e-20 0 1.95714)
(1.6832e-18 6.92472e-16 -3.40001)
(-1.16181e-18 0 -2.09744)
(1.9572e-18 0 -5.4897)
)
;
    }
    OUTLET
    {
        type            calculated;
        value           nonuniform List<vector> 
21
(
(-1.38844e-19 0 3.0223)
(-8.03644e-16 1.02001e-15 5.69729)
(8.67663e-16 -1.2311e-15 1.44914)
(6.99754e-17 -3.98852e-16 -3.38258)
(3.95824e-20 0 -3.26547)
(-2.11891e-17 1.14289e-16 -1.6215)
(-1.06466e-20 0 55.7512)
(3.65348e-20 -9.70437e-17 -3.7316)
(0 0 4.74168)
(8.89019e-16 -1.0965e-15 5.33372)
(0 0 -5.04332)
(7.7744e-16 -1.20128e-15 -1.32425)
(7.32141e-16 -1.23647e-15 -3.1468)
(-1.0688e-19 9.70436e-17 -5.67705)
(0 0 -4.63463)
(-5.17665e-16 9.00481e-16 2.82621)
(-4.17436e-20 0 -5.22986)
(-1.88636e-16 3.79137e-16 0.571346)
(2.11915e-17 -1.14289e-16 6.60129)
(1.14305e-19 0 4.20741)
(5.87352e-21 0 -54.5126)
)
;
    }
    TOP
    {
        type            calculated;
        value           nonuniform List<vector> 
110
(
(-2.55118e-24 1.06034e-20 84.5491)
(0 -1.80152e-20 22.3858)
(-9.01962e-18 1.26681e-16 13.8554)
(0 1.95476e-19 17.2803)
(0 -1.46098e-19 67.3287)
(2.57241e-18 -2.03843e-16 70.0471)
(-2.05238e-19 -2.03226e-16 68.8603)
(0 -7.97416e-19 56.206)
...
)
;
    }
    BOTTOM
    {
        type            calculated;
        value           nonuniform List<vector> 
110
(
(5.51901e-25 3.67934e-18 -26.0469)
(0 -2.25003e-22 -43.275)
(0 -6.65304e-22 -51.0282)
(0 2.47497e-22 -58.165)
(0 4.17429e-22 -64.274)
(9.64941e-18 -3.91318e-16 -68.0653)
(0 5.30957e-19 -68.5009)
(4.40707e-18 5.18917e-16 -88.9333)
...
)
;
    }
    CYLINDER
    {
        type            calculated;
        value           nonuniform List<vector> 
594
(
(3.30821e-16 -1.75349e-17 1107.22)
(-2.24969e-16 1.14359e-17 1462.97)
(0 0 1441.94)
(2.58704e-17 1.8485e-17 1072.66)
(3.17672e-16 -3.1616e-16 1123.55)
(1.95505e-16 -1.69215e-16 1171.12)
(-4.96966e-16 -1.35277e-17 1065.45)
(6.06872e-16 -2.20845e-16 1141.73)
...
)
;
    }
    JET1
    {
        type            calculated;
        value           nonuniform List<vector> 
17
(
(-6.59241e-16 -4.84465e-16 -687.953)
(-4.24457e-16 1.7833e-16 -724.006)
(-6.16388e-16 -1.24091e-18 -518.576)
(-4.28662e-16 1.37856e-16 -553.517)
(6.38185e-16 -1.93949e-16 -368.149)
(-9.7061e-16 -2.873e-17 -791.389)
(-8.54142e-16 -5.93551e-16 -796.849)
(-4.17285e-16 2.95185e-17 -678.981)
(-1.28957e-15 -6.0904e-16 -630.281)
(1.36611e-17 -1.6887e-16 -836.191)
(1.11206e-18 1.37465e-17 -394.511)
(3.82052e-16 -2.79118e-17 -479.245)
(8.18736e-16 3.57369e-16 -515.738)
(1.70889e-17 2.76466e-16 -443.982)
(-1.02225e-19 1.65381e-18 -777.485)
(7.95911e-16 1.80139e-16 -647.504)
(-7.18718e-18 -1.37437e-16 -449.119)
)
;
    }
    JET2
    {
        type            calculated;
        value           nonuniform List<vector> 
17
(
(-1.05691e-16 -3.14828e-17 -42.7134)
(-5.47757e-17 -2.82966e-17 -7.95217)
(1.08373e-17 -8.7883e-19 -57.1454)
(-3.55623e-17 -2.2683e-17 -46.4351)
(4.04275e-17 2.00132e-18 38.468)
(-7.26602e-19 -1.01832e-17 35.3474)
(-2.46845e-18 3.47275e-17 -48.1563)
(3.87662e-17 1.13092e-17 -24.134)
(-4.55928e-17 -1.17384e-17 -30.7047)
(-5.88145e-17 2.4618e-17 7.37296)
(3.30513e-17 9.65756e-19 20.1774)
(-5.00007e-17 2.22411e-17 -25.45)
(8.18455e-17 3.40409e-17 -55.5603)
(-1.00604e-17 -1.50467e-17 -61.5173)
(3.35479e-18 -3.65437e-19 -2.02881)
(5.61119e-17 1.24928e-17 -54.6095)
(-2.05942e-17 -3.81869e-19 -43.8562)
)
;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
