examples/DRLinFluids_DFDRL_cylinder/env04/system/CourantNo
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the Courant Number field from the flux field.

\*---------------------------------------------------------------------------*/

type            CourantNo;
libs            ("libfieldFunctionObjects.so");

field           phi;

executeControl  writeTime;
writeControl    writeTime;

// ************************************************************************* //
